lab11/nrf52x-base/sdk/nrf5_sdk_16.0.0_thread/components/zigbee/cli/zigbee_cli_cmd_ping.c
/**
 * Copyright (c) 2018 - 2020, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
#include "sdk_config.h"
#include "zigbee_cli_ping.h"
#include "zb_nrf52_internal.h"
#include "zb_error_handler.h"
#include "zigbee_cli.h"
#include "nrf_log_instance.h"
#include "nrf_log.h"

/**
 * @defgroup zb_cli_cmd_zcl ZCL commands
 * @ingroup zb_cli
 *
 * @{
 */

#include "zigbee_cli_utils.h"

/** @brief ZCL Frame control field of Zigbee PING commands.
 */
#define ZIGBEE_PING_FRAME_CONTROL_FIELD 0x11

#if NRF_LOG_ENABLED
/** @brief Name of the submodule used for logger messaging.
 */
#define NRF_LOG_SUBMODULE_NAME ping

NRF_LOG_INSTANCE_REGISTER(ZIGBEE_CLI_LOG_NAME, NRF_LOG_SUBMODULE_NAME,
                          ZIGBEE_CLI_CONFIG_INFO_COLOR,
                          ZIGBEE_CLI_CONFIG_DEBUG_COLOR,
                          ZIGBEE_CLI_CONFIG_LOG_INIT_FILTER_LEVEL,
                          ZIGBEE_CLI_CONFIG_LOG_ENABLED ?
                                  ZIGBEE_CLI_CONFIG_LOG_LEVEL : NRF_LOG_SEVERITY_NONE);

// This structure keeps reference to the logger instance used by this module.
typedef struct {
    NRF_LOG_INSTANCE_PTR_DECLARE(p_log)
} log_ctx_t;
#endif // NRF_LOG_ENABLED

/**@brief The row of the table which holds the replies which are to be sent.
 *
 * @details We use the table to temporarily store the parameters of the ping reply
 *          while it is traversing the ZBOSS callback system.
 *          The key parameter is the sequence number.
 */
typedef struct ping_reply_s
{
    zb_bool_t     taken;
    zb_uint16_t   remote_short_addr;
    zb_uint8_t    ping_seq;
    zb_uint8_t    count;
    zb_uint8_t    send_ack;
    nrf_cli_t   * p_cli;
} ping_reply_t;


static ping_request_t m_ping_request_table[PING_TABLE_SIZE];
static ping_reply_t   m_ping_reply_table[PING_TABLE_SIZE];
static uint8_t        m_ping_seq_num;
static ping_time_cb_t mp_ping_ind_cb = NULL;

#if NRF_LOG_ENABLED
// Logger instance used by this module.
static log_ctx_t m_log = {
    NRF_LOG_INSTANCE_PTR_INIT(p_log, ZIGBEE_CLI_LOG_NAME, NRF_LOG_SUBMODULE_NAME)
};
#endif // NRF_LOG_ENABLED

static zb_uint32_t get_request_duration(ping_request_t * p_request);

ping_request_t * zb_ping_acquire_request(void)
{
    int i;

    for (i = 0; i < PING_TABLE_SIZE; i++)
    {
        if (m_ping_request_table[i].taken == ZB_FALSE)
        {
            m_ping_request_table[i].taken = ZB_TRUE;
            return &(m_ping_request_table[i]);
        }
    }

    return NULL;
}

zb_void_t zb_ping_release_request(ping_request_t * p_reply)
{
    if (p_reply != NULL)
    {
        ZB_MEMSET(p_reply, 0x00, sizeof(ping_request_t));
    }
}

/**@brief Acquire ping reply context.
 *
 * @return  Pointer to a free ping reply context or NULL on failure.
 */
static ping_reply_t * ping_aquire_reply(void)
{
    int i;

    for (i = 0; i < PING_TABLE_SIZE; i++)
    {
        if (m_ping_reply_table[i].taken == ZB_FALSE)
        {
            m_ping_reply_table[i].taken = ZB_TRUE;
            return &(m_ping_reply_table[i]);
        }
    }

    return NULL;
}

/**@brief Release ping reply context.
 *
 * @param p_reply Pointer to the reply context structure to release.
 */
zb_void_t ping_release_reply(ping_reply_t * p_reply)
{
    if (p_reply != NULL)
    {
        ZB_MEMSET(p_reply, 0x00, sizeof(ping_reply_t));
    }
}

/**@brief Invalidate Ping Request row after the timeout - ZBOSS callback
 *
 * @param row     Number of row to invalidate
 */
static zb_void_t invalidate_row_cb(zb_uint8_t row)
{
    ping_request_t * p_request = &(m_ping_request_table[row]);
    uint32_t         delay_us = get_request_duration(p_request);

    /* Inform user about timeout event. */
    if (p_request->p_cb)
    {
        p_request->p_cb(PING_EVT_FRAME_TIMEOUT, delay_us, p_request);
    }

    zb_ping_release_request(p_request);
}

/**@brief Get the first row with request sent to addr_short, return NULL if none
 *
 * @param addr_short  Short network address to look for.
 *
 * @return  Pointer to the ping request context.
 */
static ping_request_t * find_request_by_short(zb_uint16_t addr_short)
{
    int i;

    for (i = 0; i < PING_TABLE_SIZE; i++)
    {
        if (m_ping_request_table[i].taken == ZB_TRUE)
        {
            if (m_ping_request_table[i].remote_addr_mode == ZB_APS_ADDR_MODE_16_ENDP_PRESENT)
            {
                if (m_ping_request_table[i].remote_addr.addr_short == addr_short)
                {
                    return &(m_ping_request_table[i]);
                }
            }
            else
            {
                if (zb_address_short_by_ieee(m_ping_request_table[i].remote_addr.addr_long) == addr_short)
                {
                    return &(m_ping_request_table[i]);
                }
            }
        }
    }

