lab11/nrf52x-base/sdk/nrf5_sdk_16.0.0_thread/components/zigbee/cli/zigbee_cli_cmd_ping.c
    return NULL;
}

/**@brief Get the taken row with the selected seq_num, return NULL if none
 *
 * @param seqnum Sequence Number to look for
 */
static ping_request_t * find_request_by_sn(zb_uint8_t seqnum)
{
    int i;

    for (i = 0; i < PING_TABLE_SIZE; i++)
    {
        if (m_ping_request_table[i].taken == ZB_TRUE)
        {
            if (m_ping_request_table[i].ping_seq == seqnum)
            {
                return &m_ping_request_table[i];
            }
        }
    }

    return NULL;
}

/**@brief Get row number for the ping request.
 *
 * @param[in] p_row Pointer to the ping request context.
 *
 * @return Row number, -1 if not found.
 */
static zb_int8_t get_request_row(ping_request_t * p_request)
{
    if (p_request != NULL)
    {
        return (p_request - m_ping_request_table);
    }

    return -1;
}

/**@brief Get current abs time.
 */
static time_abs_t abs_time_now(void)
{
    time_abs_t now;
    now.time_zb = ZB_TIMER_GET();
    /* Zigbee stack in end device role may disable timer at any time. */
#ifdef ZB_ED_ROLE
    now.time_tim = 0;
#else
    now.time_tim = nrf_drv_timer_capture(zb_nrf_cfg_get_zboss_timer(), NRF_TIMER_CC_CHANNEL2);
#endif
    return now;
}

/**@brief Get time difference, in microseconds between ping request identified
 *        by row number and current time.
 *
 * @param[in] p_row  Pointer to the ping request structure, from which the time difference should be calculated.
 *
 * @return  Time difference in microseconds.
 */
static zb_uint32_t get_request_duration(ping_request_t * p_request)
{
    uint32_t time_diff;

    /* Calculate the time difference between request being sent and reply being received */

    /* Zigbee stack in end device role may disable timer at any time. */
#ifdef ZB_ED_ROLE
    zb_uint32_t recv_tim = 0;
#else
    zb_uint32_t recv_tim = nrf_drv_timer_capture(zb_nrf_cfg_get_zboss_timer(), NRF_TIMER_CC_CHANNEL2);
#endif
    zb_time_t   recv_zb  = ZB_TIMER_GET();
    zb_uint32_t sent_tim = p_request->sent.time_tim;
    zb_time_t   sent_zb  = p_request->sent.time_zb;
    time_diff = (ZB_TIME_BEACON_INTERVAL_TO_USEC(ZB_TIME_SUBTRACT(recv_zb, sent_zb)) +
                 recv_tim) - sent_tim;

    return time_diff;
}

static zb_void_t frame_acked_cb(zb_bufid_t bufid)
{
    if (bufid)
    {
        zb_buf_free(bufid);
    }
}

/**@brief Default handler for incoming ping request APS acknowledgments.
 *
 * @details  If there is a user callback defined for the acknowledged request,
 *           the callback with PING_EVT_ACK_RECEIVED event will be called.
 *
 * @param[in] bufid  Reference to a ZBoss buffer containing APC ACK data,
 */
static zb_void_t dispatch_user_callback(zb_bufid_t bufid)
{
    zb_uint16_t                    short_addr;
    zb_zcl_command_send_status_t * p_cmd_ping_status;
    zb_ret_t                       zb_err_code = RET_OK;
    ping_request_t               * p_request = NULL;

    if (bufid == 0)
    {
        return;
    }

    p_cmd_ping_status = ZB_BUF_GET_PARAM(bufid, zb_zcl_command_send_status_t);

    if (p_cmd_ping_status->dst_addr.addr_type == ZB_ZCL_ADDR_TYPE_SHORT)
    {
        short_addr = p_cmd_ping_status->dst_addr.u.short_addr;
    }
    else if (p_cmd_ping_status->dst_addr.addr_type == ZB_ZCL_ADDR_TYPE_IEEE)
    {
        short_addr = zb_address_short_by_ieee(p_cmd_ping_status->dst_addr.u.ieee_addr);
    }
    else
    {
        NRF_LOG_INST_ERROR(m_log.p_log, "Ping request acknowledged with an unknown destination address type: %d", p_cmd_ping_status->dst_addr.addr_type);
        zb_buf_free(bufid);
        return;
    }

    p_request = find_request_by_short(short_addr);

    if (p_request != NULL)
    {
        uint32_t delay_us = get_request_duration(p_request);

        if (p_cmd_ping_status->status == RET_OK)
        {
            /* Inform user about ACK reception. */
            if (p_request->p_cb)
            {
                if (p_request->request_ack == 0)
                {
                    p_request->p_cb(PING_EVT_FRAME_SENT, delay_us, p_request);
                }
                else
                {
                    p_request->p_cb(PING_EVT_ACK_RECEIVED, delay_us, p_request);
                }
            }

            /* If only ACK was requested, cancel ongoing alarm. */
            if (p_request->request_echo == 0)
            {
                zb_err_code = ZB_SCHEDULE_APP_ALARM_CANCEL(invalidate_row_cb,
                                                           get_request_row(p_request));
                if (zb_err_code == RET_OK)
                {
                    zb_ping_release_request(p_request);
                }
            }
        }
        else
        {
            NRF_LOG_INST_ERROR(m_log.p_log, "Ping request returned error status: %d",
                                             p_cmd_ping_status->status);
        }
    }
    else
    {
        NRF_LOG_INST_WARNING(m_log.p_log, "Unknown ping command callback called with status: %d",
                             p_cmd_ping_status->status);
    }

    zb_buf_free(bufid);
}

/**@brief  Default ping event handler. Prints out measured time on the CLI and exits.
 *
 * @param[in] evt_type  Type of received  ping acknowledgment
 * @param[in] delay_us  Time, in microseconds, between ping request and the event.
 * @param[in] p_request Pointer to the ongoing ping request context structure.
 */
static void ping_cli_evt_handler(ping_time_evt_t evt, zb_uint32_t delay_us, ping_request_t * p_request)
{
    switch (evt)
    {
        case PING_EVT_FRAME_SCHEDULED:
            break;

        case PING_EVT_FRAME_TIMEOUT:
            nrf_cli_fprintf(p_request->p_cli,
                            NRF_CLI_ERROR,
                            "\r\nError: Request timed out after %ld ms.\r\n", delay_us/1000);
            break;

        case PING_EVT_ECHO_RECEIVED:
            nrf_cli_fprintf(p_request->p_cli,
                            NRF_CLI_NORMAL,
                            "\r\nPing time: %ld ms\r\n", delay_us/1000);
            print_done(p_request->p_cli, ZB_FALSE);
            break;

        case PING_EVT_ACK_RECEIVED:
            if (p_request->request_echo == 0)
            {
                nrf_cli_fprintf(p_request->p_cli,
                                NRF_CLI_NORMAL, "\r\nPing time: %ld ms\r\n",
                                delay_us/1000);
                print_done(p_request->p_cli, ZB_FALSE);
            }
            break;

