lab11/nrf52x-base/sdk/nrf5_sdk_16.0.0_thread/components/zigbee/cli/zigbee_cli_cmd_ping.c
        case PING_EVT_FRAME_SENT:
            if ((p_request->request_echo == 0) &&
                (p_request->request_ack  == 0))
            {
                print_done(p_request->p_cli, ZB_FALSE);
            }
            break;

        case PING_EVT_ERROR:
            print_error(p_request->p_cli, "Unable to send ping request", ZB_TRUE);
            break;

        default:
          NRF_LOG_INST_ERROR(m_log.p_log, "Unknown ping event received: %d", evt);
          break;
    }
}

void zb_ping_set_ping_indication_cb(ping_time_cb_t p_cb)
{
    mp_ping_ind_cb = p_cb;
}

zb_void_t ping_request_send(ping_request_t * p_request)
{
    zb_uint8_t   cli_ep = zb_get_cli_endpoint();
    zb_ret_t     zb_err_code;
    zb_bufid_t   bufid;
    zb_uint8_t * p_cmd_buf;

    if (p_request->count > PING_MAX_LENGTH)
    {
        if (p_request->p_cb)
        {
            p_request->p_cb(PING_EVT_ERROR, 0, p_request);
        }

        return;
    }

    bufid = zb_buf_get_out();
    if (!bufid)
    {
        if (p_request->p_cb)
        {
            p_request->p_cb(PING_EVT_ERROR, 0, p_request);
        }
        return;
    }

    /* We're constructing the Ping Frame by 'overloading' the common ZCL frame.
     * Basically every frame which comes addressed to the PING_CUSTOM_CLUSTER
     * is considered a Ping Frame. The FCF is being set to 0x00, the sequence
     * number field is being used as a Ping Sequence Number, while the Command
     * field is used to distinguish request/reply. The farther payload of the
     * ping is filled with bytes PING_ECHO_REQUEST_BYTE/PING_ECHO_REPLY_BYTE.
     */
    p_cmd_buf = ZB_ZCL_START_PACKET(bufid);
    *(p_cmd_buf++) = ZIGBEE_PING_FRAME_CONTROL_FIELD;
    *(p_cmd_buf++) = m_ping_seq_num; /* Sequence Number Field */

    /* Fill Command Field */
    if ((p_request->request_echo) && (p_request->request_ack))
    {
        *(p_cmd_buf++) = PING_ECHO_REQUEST;
    }
    else if ((p_request->request_echo) && (!p_request->request_ack))
    {
        *(p_cmd_buf++) = PING_ECHO_NO_ACK_REQUEST;
    }
    else
    {
        *(p_cmd_buf++) = PING_NO_ECHO_REQUEST;
    }

    memset(p_cmd_buf, PING_ECHO_REQUEST_BYTE, p_request->count);
    p_cmd_buf += p_request->count;
    p_request->ping_seq = m_ping_seq_num;
    m_ping_seq_num++;

    /* Capture the sending time */
    p_request->sent = abs_time_now();

    /* Actually send the frame */
    if (p_request->request_ack)
    {
        zb_err_code = zb_zcl_finish_and_send_packet(bufid, p_cmd_buf, &(p_request->remote_addr),
                                                    p_request->remote_addr_mode, cli_ep, cli_ep,
                                                    ZB_AF_HA_PROFILE_ID, PING_CUSTOM_CLUSTER,
                                                    dispatch_user_callback);
        ZB_ERROR_CHECK(zb_err_code);
    }
    else
    {
        zb_zcl_finish_and_send_packet_no_ack(bufid, p_cmd_buf, &(p_request->remote_addr),
                                             p_request->remote_addr_mode, cli_ep, cli_ep,
                                             ZB_AF_HA_PROFILE_ID, PING_CUSTOM_CLUSTER,
                                             dispatch_user_callback);
    }

    if (p_request->p_cb)
    {
        uint32_t time_diff = get_request_duration(p_request);
        p_request->p_cb(PING_EVT_FRAME_SCHEDULED, time_diff, p_request);
    }

    zb_err_code = ZB_SCHEDULE_APP_ALARM(invalidate_row_cb,
                                        get_request_row(p_request),
                                        ZB_MILLISECONDS_TO_BEACON_INTERVAL(p_request->timeout_ms));
    ZB_ERROR_CHECK(zb_err_code);
}

/**@brief Actually construct the Ping Reply frame and send it.
 *
 * @param p_row  Pointer to the ping reply context structure.
 */
static zb_void_t ping_reply_send(ping_reply_t * p_reply)
{
    zb_bufid_t   bufid;
    zb_uint8_t * p_cmd_buf;
    zb_uint8_t   cli_ep = zb_get_cli_endpoint();
    zb_ret_t     zb_err_code;

    bufid = zb_buf_get_out();
    if (!bufid)
    {
        NRF_LOG_INST_WARNING(m_log.p_log, "Drop ping request due to the lack of output buffers");
        ping_release_reply(p_reply);
        return;
    }

    NRF_LOG_INST_DEBUG(m_log.p_log, "Send ping reply");
    p_cmd_buf = ZB_ZCL_START_PACKET(bufid);
    *(p_cmd_buf++) = ZIGBEE_PING_FRAME_CONTROL_FIELD;
    *(p_cmd_buf++) = p_reply->ping_seq;
    *(p_cmd_buf++) = PING_ECHO_REPLY;
    memset(p_cmd_buf, PING_ECHO_REPLY_BYTE, p_reply->count);
    p_cmd_buf += p_reply->count;

    /* Actually send the frame */
    if (p_reply->send_ack)
    {
        zb_err_code = zb_zcl_finish_and_send_packet(bufid, p_cmd_buf, (zb_addr_u *)(&(p_reply->remote_short_addr)),
                                                    ZB_APS_ADDR_MODE_16_ENDP_PRESENT, cli_ep, cli_ep,
                                                    ZB_AF_HA_PROFILE_ID, PING_CUSTOM_CLUSTER,
                                                    frame_acked_cb);
        ZB_ERROR_CHECK(zb_err_code);
    }
    else
    {
        zb_zcl_finish_and_send_packet_no_ack(bufid, p_cmd_buf, (zb_addr_u *)(&(p_reply->remote_short_addr)),
                                             ZB_APS_ADDR_MODE_16_ENDP_PRESENT, cli_ep, cli_ep,
                                             ZB_AF_HA_PROFILE_ID, PING_CUSTOM_CLUSTER,
                                             frame_acked_cb);
    }

    /* We don't need the row in this table anymore, since we're not expecting
     * any reply to a Ping Reply. */
    ping_release_reply(p_reply);
}

/**@brief Indicate ping request reception.
 *
 * @param zcl_cmd_bufid  Zigbee buffer id with the received ZCL packet.
 */
static void ping_req_indicate(zb_bufid_t zcl_cmd_bufid)
{
    ping_request_t        tmp_request;
    zb_zcl_parsed_hdr_t * p_cmd_info = ZB_BUF_GET_PARAM(zcl_cmd_bufid, zb_zcl_parsed_hdr_t);

    if (mp_ping_ind_cb == NULL)
    {
        return;
    }

    memset(&tmp_request, 0, sizeof(ping_request_t));

    switch (p_cmd_info->cmd_id)
    {
        case PING_ECHO_REQUEST:
            tmp_request.request_echo = 1;
            tmp_request.request_ack  = 1;
            break;

        case PING_ECHO_NO_ACK_REQUEST:
            tmp_request.request_echo = 1;
            break;

        case PING_NO_ECHO_REQUEST:
            break;

        default:
            // Received frame is not a ping request.
            return;
    }

    tmp_request.taken    = ZB_TRUE;
    tmp_request.ping_seq = p_cmd_info->seq_number;
    tmp_request.count    = zb_buf_len(zcl_cmd_bufid);
    tmp_request.sent     = abs_time_now();

    if (p_cmd_info->addr_data.common_data.source.addr_type != ZB_ZCL_ADDR_TYPE_SHORT)
    {
        NRF_LOG_INFO("Ping request received, but indication will not be generated due to the unsupported address type.")
        return; // Not supported.
    }
    tmp_request.remote_addr_mode       = ZB_APS_ADDR_MODE_16_ENDP_PRESENT;
    tmp_request.remote_addr.addr_short = p_cmd_info->addr_data.common_data.source.u.short_addr;

    mp_ping_ind_cb(PING_EVT_REQUEST_RECEIVED,
                   ZB_TIME_BEACON_INTERVAL_TO_USEC(tmp_request.sent.time_zb),
                   &tmp_request);
}

/**@brief The Handler to 'intercept' every frame coming to the endpoint
 *
 * @param bufid    Reference to a ZBOSS buffer
 */
static zb_uint8_t cli_agent_ep_handler_ping(zb_bufid_t bufid)
{
    zb_zcl_parsed_hdr_t * p_cmd_info = ZB_BUF_GET_PARAM(bufid, zb_zcl_parsed_hdr_t);
    zb_uint32_t time_diff;

    if (p_cmd_info->cluster_id != PING_CUSTOM_CLUSTER ||
        p_cmd_info->profile_id != ZB_AF_HA_PROFILE_ID)
    {
        return ZB_FALSE;
    }

