lab11/nrf52x-base/sdk/nrf5_sdk_16.0.0_thread/components/zigbee/cli/zigbee_cli_cmd_ping.c
    NRF_LOG_INST_DEBUG(m_log.p_log, "New ping frame received, bufid: %d", bufid);
    ping_req_indicate(bufid);

    if (p_cmd_info->cmd_id == PING_ECHO_REPLY)
    {
        zb_uint16_t remote_short_addr = 0x0000;

        /* We have our ping reply */
        ping_request_t * p_request = find_request_by_sn(p_cmd_info->seq_number);
        if (p_request == NULL)
        {
            return ZB_FALSE;
        }

        if (p_request->remote_addr_mode == ZB_APS_ADDR_MODE_16_ENDP_PRESENT)
        {
            remote_short_addr = p_request->remote_addr.addr_short;
        }
        else
        {
            remote_short_addr = zb_address_short_by_ieee(p_request->remote_addr.addr_long);
        }

        if (p_cmd_info->addr_data.common_data.source.addr_type == ZB_ZCL_ADDR_TYPE_SHORT)
        {
            if (remote_short_addr != p_cmd_info->addr_data.common_data.source.u.short_addr)
            {
                return ZB_FALSE;
            }
        }
        else
        {
            return ZB_FALSE;
        }

        /* Catch the timers value */
        time_diff = get_request_duration(p_request);

        /* Cancel the ongoing alarm which was to erase the row... */
        zb_ret_t zb_err_code = ZB_SCHEDULE_APP_ALARM_CANCEL(invalidate_row_cb,
                                                            get_request_row(p_request));
        ZB_ERROR_CHECK(zb_err_code);

        /* Call callback function in order to indicate echo response reception. */
        if (p_request->p_cb)
        {
            p_request->p_cb(PING_EVT_ECHO_RECEIVED, time_diff, p_request);
        }

        /* ...and erase it manually */
        if (zb_err_code == RET_OK)
        {
            zb_ping_release_request(p_request);
        }

    }
    else if ((p_cmd_info->cmd_id == PING_ECHO_REQUEST) ||
             (p_cmd_info->cmd_id == PING_ECHO_NO_ACK_REQUEST))
    {
        zb_uint8_t     len = zb_buf_len(bufid);
        ping_reply_t * p_reply = ping_aquire_reply();

        if (p_reply == NULL)
        {
            NRF_LOG_INST_WARNING(m_log.p_log, "Cannot obtain new row for incoming ping request");
            return ZB_FALSE;
        }

        /* Save the Ping Reply information in the table and schedule a sending function */
        p_reply->count = len;
        p_reply->ping_seq = p_cmd_info->seq_number;

        if (p_cmd_info->cmd_id == PING_ECHO_REQUEST)
        {
            NRF_LOG_INST_DEBUG(m_log.p_log,
                               "PING echo request with APS ACK received");
            p_reply->send_ack = 1;
        }
        else
        {
            NRF_LOG_INST_DEBUG(m_log.p_log,
                               "PING echo request without APS ACK received");
            p_reply->send_ack = 0;
        }

        if (p_cmd_info->addr_data.common_data.source.addr_type == ZB_ZCL_ADDR_TYPE_SHORT)
        {
            p_reply->remote_short_addr = p_cmd_info->addr_data.common_data.source.u.short_addr;
        }
        else
        {
            NRF_LOG_INST_WARNING(m_log.p_log, "Drop ping request due to incorrect address type");
            ping_release_reply(p_reply);
            zb_buf_free(bufid);
            return ZB_TRUE;
        }

        /* Send the Ping Reply, if not possible then invalidate the row */
        ping_reply_send(p_reply);
    }
    else if (p_cmd_info->cmd_id == PING_NO_ECHO_REQUEST)
    {
        NRF_LOG_INST_DEBUG(m_log.p_log,
                          "PING request without ECHO received");
    }
    else
    {
        NRF_LOG_INST_WARNING(m_log.p_log,
                             "Unsupported Ping message received, cmd_id %d\r\n",
                             p_cmd_info->cmd_id);
    }

    zb_buf_free(bufid);
    return ZB_TRUE;
}

/** @brief ping over ZCL
 *
 * @code
 * zcl ping [--no-echo] [--aps-ack] <h:dst_addr> <d:payload size>
 * @endcode
 *
 * Example:
 * @code
 * zcl ping 0b010eaafd745dfa 32
 * @endcode
 *
 * @pre Ping only after starting @ref zigbee.
 *
 * Issue a ping-style command to another CLI device of the address `dst_addr`
 * by using `payload_size` bytes of payload.<br>
 *
 * Optionally, the device can request an APS acknowledgment (`--aps-ack`) or
 * ask destination not to sent ping reply (`--no-echo`).<br>
 *
 * To implement the ping-like functionality, a new custom cluster has been
 * defined with ID 64. There are four custom commands defined inside it,
 * each with its own ID.
 *
 * See the following flow graphs for details.
 *
 * - <b>Case 1:</b> Ping with echo, without the APS acknowledgment (default mode):
 *   @code
 *       App 1          Node 1                 Node 2
 *         |  -- ping ->  |  -- ping request ->  |   (command ID: 0x02 - ping request without the APS acknowledgment)
 *         |              |    <- MAC ACK --     |
 *         |              | <- ping reply --     |   (command ID: 0x01 - ping reply)
 *         |              |    -- MAC ACK ->     |
 *         |  <- Done --  |                      |
 *   @endcode
 *
 *   In this default mode, the `ping` command measures the time needed for a Zigbee frame to travel between two nodes in the network (there and back again). The command uses a custom "overloaded" ZCL frame, which is constructed as a ZCL frame of the new custom ping ZCL cluster (ID 64).
 *
 * - <b>Case 2:</b> Ping with echo, with the APS acknowledgment:
 *     @code
 *       App 1          Node 1                 Node 2
 *         |  -- ping ->  |  -- ping request ->  |   (command ID: 0x00 - ping request with the APS acknowledgment)
 *         |              |    <- MAC ACK --     |
 *         |              |    <- APS ACK --     |
 *         |              |    -- MAC ACK ->     |
 *         |              | <- ping reply --     |   (command ID: 0x01 - ping reply)
 *         |              |    -- MAC ACK ->     |
 *         |              |    -- APS ACK ->     |
 *         |              |    <- MAC ACK --     |
 *         |  <- Done --  |                      |
 *     @endcode
 *
 * - <b>Case 3:</b> Ping without echo, with the APS acknowledgment:
 *     @code
 *       App 1          Node 1                 Node 2
 *         |  -- ping ->  |  -- ping request ->  |   (command ID: 0x03 - ping request without echo)
 *         |              |    <- MAC ACK --     |
 *         |              |    <- APS ACK --     |
 *         |              |    -- MAC ACK ->     |
 *         |  <- Done --  |                      |
 *     @endcode
 *
 * - <b>Case 4:</b> Ping without echo, without the APS acknowledgment:
 *     @code
 *       App 1          Node 1                 Node 2
 *         |  -- ping ->  |  -- ping request ->  |   (command ID: 0x03 - ping request without echo)
 *         |  <- Done --  |                      |
 *         |              |    <- MAC ACK --     |
 *     @endcode
 */
void cmd_zb_ping(nrf_cli_t const * p_cli, size_t argc, char **argv)
{
    ping_request_t * p_row;
    uint8_t          i;

    if (nrf_cli_help_requested(p_cli) || (argc == 1))
    {
        print_usage(p_cli, argv[0],
                    "[--no-echo] [--aps-ack] <h:addr> <d:payload size>");
        return;
    }

    if ((argc > 5) || (argc < 3))
    {
        print_error(p_cli, "Wrong number of arguments", ZB_FALSE);
        return;
    }

    p_row = zb_ping_acquire_request();
    if (p_row == NULL)
    {
        print_error(p_cli, "Request pool empty - wait a bit", ZB_FALSE);
        return;
    }

    p_row->p_cb         = ping_cli_evt_handler;
    p_row->request_ack  = 0;
    p_row->request_echo = 1;
    p_row->timeout_ms   = PING_ECHO_REQUEST_TIMEOUT_S * 1000;

    for (i = 1; i < (argc - 2); i++)
    {
        if (strcmp(argv[i], "--aps-ack") == 0)
        {
            p_row->request_ack = 1;
        }
        else if (strcmp(argv[i], "--no-echo") == 0)
        {
            p_row->request_echo = 0;
        }
    }

    p_row->remote_addr_mode = parse_address(argv[argc - 2], &(p_row->remote_addr), ADDR_ANY);
    if (p_row->remote_addr_mode == ADDR_INVALID)
    {
        print_error(p_cli, "Wrong address format", ZB_FALSE);
        zb_ping_release_request(p_row);
        return;
    }

    if (!sscanf(argv[argc - 1], "%hd", &(p_row->count)))
    {
        print_error(p_cli, "Incorrect ping payload size", ZB_FALSE);
        zb_ping_release_request(p_row);
        return;
    }

    if (p_row->count > PING_MAX_LENGTH)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "Note: Ping payload size exceeds maximum possible, assuming maximum\r\n");
        p_row->count = PING_MAX_LENGTH;
    }

    /* Put the CLI instance to be used later */
    p_row->p_cli = (nrf_cli_t*)p_cli;

    ping_request_send(p_row);
}


/**@brief Endpoint handlers
 */
NRF_ZIGBEE_EP_HANDLER_REGISTER(ping, cli_agent_ep_handler_ping);

/** @} */
